/**
 * 各区县情况
 * name:区县名称
 * feature:特色
 * actuality:现状
 * future:未来
 * plant：种养殖分布图
 * agrometeorological:农业气候区划
 * 
 */
var listCity=new Array();
listCity.push(JSON.parse('{"name":"原平市","feature":"原平是山西省北部唯一的县级市，由忻州代管。地处山西北中部，东临五台县，西靠宁武县，南与忻府区、定襄县毗邻，北和代县、朔州市平鲁区、朔州市朔城区接壤。原平市辖3个街道、7个镇、11个乡，520个行政村，户籍总人口49.76万（2013年）。辖区东西相距62公里，南北长约58公里，总面积2571平方公里，耕地面积111万亩。原平是国家卫生城市[1]  、中国诗歌之乡、“山西省资源型经济转型综合配套改革试验区先行试点”和“扩权强县试点”的双试点城市。名片：“铝电名城、酥梨基地、三班故里、慧远故里、晋贤故里、将军之乡、书画之乡”。","actuality":"原平农业以商品粮、制种、畜牧、经济林、蔬菜等五大基地建设为主体，是玉米、高梁、青椒定点制种基地，商品粮生产基地和蔬菜生产基地。2012年，辖区农业产值109842万元，林业产值5616万元，牧业产值89295万元，渔业产值518万元，农林牧渔服务业产值4700万元。","future":"坚持改革引领。因地制宜，综合施策，在转型创新上加快步伐，坚持以供给侧结构性改革为主线，做优存量、做大增量，激发活力，大力推进传统行业的改造升级和新兴产业的发展壮大。市四大班子成员要以身作则，以上率下，直面问题，迎难而上。","plant":"img/fbt.png","agrometeorological":"img/qiht.png"}'));
listCity.push(JSON.parse('{"name":"代县","feature":"代县，位于山西省东北部，隶属于山西省忻州市。国家历史文化名城。被文化部命名为“中国民间绘画画乡”和“中国民间文化艺术之乡”。","actuality":"2012年，黄酒产业年产黄酒6万吨，带动农户种植黍米10 万亩；辣椒产业加工鲜辣椒1.8 万吨；加工小杂粮2.5 万吨，带动农户种植小杂粮15万亩。干鲜果产业加工干鲜果0.2 万吨；水稻产业通过土地整理，恢复水稻种植面积3万亩，加工优质稻米1万吨。蔬菜产业生产反季节蔬菜2 万吨。[14]2013年，代县农产品完成销售收入2.02亿元，同比2012年增长34.3%。粮食生产达1.73亿斤，同比2012年增长5.9%。","future":"代县县委、县政府今年坚持“一乡一业、一村一品”和“两带四园八大产业”的发展思路，立足农业资源优势、区位优势和特色优势，以农民收入翻番为目标，以农业产业化为抓手，全面推进了现代农业发展进程。<br/>加快农业“两带”建设步伐。<br/>加快特色农副产品加工步伐。","plant":"img/fbt.png","agrometeorological":"img/qiht.png"}'));
listCity.push(JSON.parse('{"name":"繁峙县","feature":"繁峙县，位于山西省东北部，隶属山西省忻州市。北靠“五岳”之一的北岳恒山，与应县、浑源县相接，南依“四大佛教名山”之一的五台山，东邻灵丘县及河北省阜平县，西界代县。繁峙县总面积2369平方公里，辖13个乡镇，人口266800（2010年末）。属温带大陆性气候，年平均气温6.3℃，年降水量400毫米左右，无霜期130天。<br/>繁峙县始建于春秋时期，历史悠久，繁峙从隋朝开皇十八年（598）年得名。","actuality":"整合涉农资金7400万元，改造中低产田，打造砂河、大营、杏园等6个万亩玉米高产示范片，33万亩玉米亩均增产50公斤，农民人均纯收入增加70余元，粮食总产量达7300万公斤。  繁峙县新建设施农业园区5个，农业面积达5000亩。投资210万元，扶持发展22个农民专业合作社。","future":"繁峙县强化用工业思维发展农业的理念，把效益、市场、营销、品牌、标准化、规避风险、项目带动等引入农业发展，逐步改善传统农业弱质产业、低效产业的地位。以培育特色高效农业为重点，进一步优化产业布局，改善农业生产条件，实施粮食高产工程，壮大规模健康养殖，做大农业加工龙头，农业结构进一步优化，农业效益进一步显现。<br/>改善农业生产条件，品质化提升特色农业。<br/>实施粮食高产工程，产业化扩张优质基地。<br/>壮大规模健康养殖，规模化推进设施农业。<br/>做大农业加工龙头，园区化带动现代农业。","plant":"img/fbt.png","agrometeorological":"img/qiht.png"}'));
listCity.push(JSON.parse('{"name":"静乐县","feature":"东部与忻府区、阳曲毗邻，南接娄烦、古交，西邻岚县、岢岚，北靠宁武、原平。是太原、忻州和西北部县区联系的重要枢纽，忻黑线、宁白线、忻五线、康北线网络分布，宁静铁路即将通车，太古岚铁路规划建设，太佳高速已建成通车，忻保高速全面开工，区位优越，交通便利。2017年10月，被住建部命名为国家园林县城。","actuality":"静乐县土地面积308万亩，其中耕地49万亩，林地37万亩，草地74万亩，尚可开发利用的宜林宜牧地141万亩。[5]  静乐是传统农业大县，截止2012年，全县粮食种植面积41.41万亩，粮食总产7800万斤，农业财政总投入为2016万元，农业生产总值3.7亿元，占地区生产总值的19%，同比2011年增长17.6%，其中种植业1.73亿元、占46.2%，养殖业1.25亿元、占33.4%，林业0.65亿元、占17.4%。农民人均收入达到4022元。<br/>静乐县于2010年新引进藜麦珍稀粮食品种，2013年达到10000亩的种植规模，成为世界第三大藜麦种麦植区，被中国食品工业协会誉为“中国藜麦之乡”","future":"静乐将根据“做大优势、打造品牌，努力建设特色农业大县”的奋斗目标，继续加强政策、信贷、良种、技术、培训、销售等服务，搞好农业特色品牌系列认证，充分发挥龙头企业的带动作用，扩大农企领域招商引资，致力于推进农业产业化体系建设，走出一条具有静乐特色的农业产业化发展之路。","plant":"img/fbt.png","agrometeorological":"img/qiht.png"}'));
listCity.push(JSON.parse('{"name":"定襄县","feature":"定襄县是山西省忻州市所辖，位于山西省北中部。三面群山环抱，境内四水贯流。全县地形由东向西呈簸箕形。北面以将军山五台山余脉与原平市、五台县毗邻，东南以文山、系舟山与盂县、阳曲县接壤，西与忻府区相邻。定襄县东西长48公里，南北宽36公里，总面积865平方公里。定襄县总人口约217468人。定襄县政府驻城关镇。忻州至河边的支线铁路、忻州至阜平的干线公路横穿全境。<br/>定襄地处忻定盆地，土地肥沃，气候温和，是忻州市粮食主产区。<br/>定襄县历史悠久，拥有属龙山文化的西社、横山、白村等新石器时代遗址，县城西、南残垣断壁，为西汉阳曲古城遗迹。","actuality":"2012年定襄建设24个万亩玉米丰产方片，定襄县粮食总产量达到3.3亿斤。定襄县瓜菜总收入达到2亿元。受禄乡千亩设施农业园区的温室大棚亩均收入达到2.8万元，带动当地人均增收2640元。建成各类规模养殖场8个。2012年定襄实施了4.5万平方米、1000人的移民扶贫小区建设工程，对1.2万个农村劳动力进行了就业培训。","future":"“一创三强五推动”工作主线:一创是引深创卫成效;三强是强化项目引领，强化产业支撑，强化基础设施建设;五推动是推动民生改善，推动社保扩面提质，推动社会事业发展，推动安全稳定工作，推动作风转变。","plant":"img/fbt.png","agrometeorological":"img/qiht.png"}'));
listCity.push(JSON.parse('{"name":"五台县","feature":"五台县位于山西省境东北部，隶属于山西省忻州市，属土石山区，东与河北省以太行山脊为界。面积2865平方公里，辖6镇24乡。属温带大陆性气候。<br/>五台县境内的五台山，山峦重叠，地形复杂，东，由东、西、中、南、北、五台组成，号称“华北屋脊”。位居全国四大佛教名山之首。[ 1-2] <br/>五台县位置偏北，地势又高，气候寒冷，素有“华北小兴安岭”之称。年均气温5℃，一月零下11℃，七月21℃。年降雨量500毫米，无霜期90—150天","actuality":"全年全县农作物种植面积29390公顷，比上年增加280公顷。其中，粮食种植面积28683公顷，增加284公顷；油料种植面积326公顷，减少24公顷；在粮食种植面积中，玉米种植面积20243公顷，增加495公顷。<br/>全年粮食产量12万吨，比上年增加0.72万吨，增产6.4%。<br/>全年完成造林2227公顷，增长-47%。其中，荒山荒地造林面积2227公顷，增长-47%。<br/>全年全县猪牛羊肉总产量1.11万吨，比上年增长25%。其中，猪肉产量0.35万吨，增长13%；牛肉产量0.41万吨，增长20%；羊肉产量0.36万吨，增长-1.1%。年末生猪存栏2.9万头，生猪出栏3.66万头。牛奶产量581吨，增长645%。禽蛋产量0.36万吨，增长-8.9%。水产品产量436吨，增长280%。","future":"年末全县农业机械总动力13.87万千瓦，增长11.6%。机械耕地面积2.4万公顷，增长-1.4%；机械播种面积2.4万公顷，机械收获面积0.81万公顷，分别增长3.7%和28.9%。全县农机化经营总收入3611万元，增长8.8%。","plant":"img/fbt.png","agrometeorological":"img/qiht.png"}'));
listCity.push(JSON.parse('{"name":"神池县","feature":"神池县，忻州市辖县。地处晋西北黄土高原，地跨东经111°—112°18′，北纬38°56′—39°24′之间。始建于春秋时期，历史悠久，东北隔内长城与朔州为邻，东南和南部分别与宁武县为界，西与五寨县毗连，北与偏关县的大部分和平鲁县的部分接壤。<br/>神池县是典型的农业县，收入主要来源于种植、养殖等。乡镇企业和工业基础薄弱。主要产品有煤、水泥、铝矾土等。","actuality":"2012—2013年建成了贺职义井万亩玉米丰产方、八角万亩马铃薯脱毒起垄种植高产基地、烈堡大严备万亩油料、万亩燕麦基地、长畛5000亩谷子五大小杂粮示范基地。积极开展地膜玉米新品种、机械化、高密度精量播种、油料新品种高产和渗水地膜覆盖等试验工作并取得成功，增产效果明显，增产率达25.5%。五大基地带动全县农户种植玉米20万亩，莜麦15万亩，胡麻15万亩，马铃薯10万亩，豆类5万亩，谷子3万亩，糜黍2万亩，瓜菜3万亩、青饲草料2万亩，全县农作物总播面积达到了75万亩。[9]  完善和新建了五百亩设施瓜菜园区1个、百亩设施瓜菜园区6个、五十亩设施瓜菜园区5个。做好农机购置补贴工作。全县共完成农机购置补贴444.68万元，补贴机具652台，受益农户562户，全县农机总动力达到18万千瓦，提高了农业科技水平和农业综合生产能力。","future":"加快有机旱作农业发展,培育特色优势产业,推进农业现代化进程","plant":"img/fbt.png","agrometeorological":"img/qiht.png"}'));
listCity.push(JSON.parse('{"name":"五寨县","feature":"山西省忻州市五寨县位于忻州市西部，总面积1379平方千米，总人口10.8万人（2010年），五寨县辖3个镇、9个乡。县人民政府驻砚城镇。地势东南高，西部低。东南为石山区，主峰芦芽山海拔2736米，为县境最高峰。中部为“丁“字形盆地，以三岔为最低海拔1300米。北部与西北部为黄土丘陵。五寨县境内主要河流是朱家川河及其支流清连河。年均气温4.3℃，一月零下14℃，七月19℃。年降雨量500毫米，无霜期120天。<br/>五寨县是山西省的富水区之一，境内的河流众多有“坐在水库”上的县之称，南山生态自然旅游区被人们称为北方的“五寨沟”有芦芽山等景点。","actuality":"2012年五寨县落实播种面积74.4万亩，建成玉米丰产方15个，小杂粮丰产方12个，万亩玉米高产创建示范区1个，马铃薯集中连片起垄栽培播种示范区1个，马铃薯繁育网棚40座，马铃薯原种高山繁育基地1000亩。五寨县玉米、马铃薯、小杂粮种植面积分别达到36万亩、20万亩、15万亩。","future":"以文化旅游业为龙头，带动服务业跨越发展.<br/>以环境保护为抓手，推动绿色发展.","plant":"img/fbt.png","agrometeorological":"img/qiht.png"}'));
listCity.push(JSON.parse('{"name":"岢岚县","feature":"岢岚县隶属于山西省忻州市，位于晋西北黄土高原中部，管涔山西北麓。辖区国土面积1984平方公里，其中耕地78万亩，县政府驻岚漪镇。<br/>岢岚县是“全国双拥模范城”、“全国平安建设先进县”、“全省一县一业先进县”、“全省植树造林先进县”。至2013年，岢岚县辖2个镇、10个乡，202个行政村，总人口85784人，地区生产总值171447万元。","actuality":"截至2013年末，岢岚县农业机械总动力122513千瓦，比2012年增长6.2%。机械耕地面积15000公顷，比2012年增长15.4%；机械播种面积13550公顷，机械收获面积6800公顷，分别比2012年增长4.2%和4.6%。农机化经营总收入2846万元，比2012年增长6.1%。","future":"政府帮扶要有机制，扶持那些有上进心、有内生动力的人；政府要通过政策宣传、技术培训等全力以赴搞好服务。他希望，广大农民群众充分调动主观能动性，在政府的引导支持下，不断探索农业发展的新路子。","plant":"img/fbt.png","agrometeorological":"img/qiht.png"}'));
listCity.push(JSON.parse('{"name":"偏关县","feature":"偏关县位于山西省西北边陲，处于黄河南流入晋的交汇处。北依长城与内蒙古清水河县接壤，西临黄河与内蒙古准格尔旗准格尔旗隔河相望，南与河曲、五寨两县相连，东于神池、朔州两县（市）毗邻。县境东西长60千米，南北宽58千米，全县总面积1682平方千米，总人口11万人（2004年）。<br/>偏头关与宁武关、雁门关合称中华三关，是明代长城外三关之首，偏关为“三晋之屏藩”、“晋北之锁钥”。","actuality":"2012年该县共有耕地54.25万亩，农作物主要有谷、糜、豆类、山药、莜麦、胡麻等。经济作物除油料还有海红子、桃、沙果、杏、沙果、苹果、葡萄等。","future":"传统产业转型升级。提升改造传统建材、农副产品加工、煤炭加工运销企业等。","plant":"img/fbt.png","agrometeorological":"img/qiht.png"}'));
listCity.push(JSON.parse('{"name":"河曲县","feature":"河曲县是中国民间艺术之乡。  河曲县地处草原文化与中原文化的交汇地带，河曲民歌、二人台艺术已列入首批“国家非物质文化遗产”名录  。河曲县碓臼墕村二月二灯盏会也得到介绍。","actuality":"2013年，河曲县发展马铃薯种植8.3万亩，脱毒种薯普及率达到87%；发展新型日光节能温室280亩，小弓棚蔬菜种植2000亩，富硒功能性农作物1800亩；发展标准化畜禽养殖户130户，新建标准化羊舍2.2万平方米，河曲县牛饲养量达到7100头，羊22.3万只，猪5.2万头，鸡53万羽。“一村一品”专业村达到47个，发展农民专业合作社71个，“三品一标”认证7个；百企千村产业扶贫山煤河曲乳制品项目破土动工，农产品加工“513”企业销售收入实现2.15亿元。<br/>农林牧渔业总产值完成5.73亿元，比2012年增长7%。粮食总产量首次达到1.28亿斤。","future":"全面推进1266工作思路，用创新思维推动发展、用辩证思维统筹兼顾，以敢于担当、敢为人先的精神，紧跟大势，乘势而上，赢得发展制高点和主动权，努力把河曲建设成为富裕文明、开放和谐、充满活力的黄河晋陕蒙三角区经济文化中心。","plant":"img/fbt.png","agrometeorological":"img/qiht.png"}'));
listCity.push(JSON.parse('{"name":"保德县","feature":"保德县隶属于山西省忻州市，地处吕梁山北段西坡、黄土高原东部边缘地带，属典型的温带大陆性气候，水陆两路连通四面八方，神朔铁路、神保线二级公路、沿黄干线公路、忻保高速穿境而过，是晋西北与陕西、内蒙联系的重要纽带。南北长约45公里，东西宽约21.7公里，总面积为997.4平方公里。2010年，保德县共有4个镇、9个乡、343个行政村、383个自然村，人口160035人。 2002年、2004年、2008年，保德县三度跻身县域经济基本竞争力提升速度最快的“全国百强县”。","actuality":"2013年1月到10月，全县生猪存栏3.5万头，牛存栏0.3万头，羊存栏9.6万只，家禽存栏21万只，肉类总产0.24万吨，禽蛋总产0.15万吨，奶类总产180吨，畜牧业总产值1.5亿元。<br/>2013年1月到11月，保德县设施农业总面积达到3675亩，总产值达到0.6亿元，2014年将继续打造5个百亩园区、10个五十亩园区，投资1亿元的繁庄塔千亩园区建成投入运营。“两红”种植面积已发展到10万余亩，农产品加工厂40余家。","future":"将继续坚持把发展产业作为脱攻坚的核心举措,抓特色产业和抓龙头企业并举,以“4个1000万”特惠补助为重点，即：退耕还林特惠补助1000万、特色养殖补助1000万、经济林种植补贴1000万、扶贫领域科技创新补贴1000万，强力助推产业发展。","plant":"img/fbt.png","agrometeorological":"img/qiht.png"}'));
listCity.push(JSON.parse('{"name":"宁武县","feature":"宁武县，又称凤凰城，隶属于山西省忻州市，位于山西省北中部。地理坐标东经111°50‘－120°40’、北纬38°31′-39°8′。北邻朔州，西北与神池县接壤，西南与五寨、岢岚相望，南与静乐县相接，东南与忻州分界，东部与原平市相接。总面积1987.7平方公里，设4镇10乡，辖483个行政村，居住人口15万（2010年）","actuality":"2013年，宁武县农作物种植面积44.58万公顷，比2012年减少0.4万公顷。其中，粮食种植面积4.72万公顷，比2012年增加0.08万公顷。油料种植面积1.09万公顷，比2012年减少0.19万公顷。玉米种植面积2.2万公顷，比2012年增加0.45万公顷，增长1.82%。粮食产量19.57万吨，比2012年增加6.15万吨，增产3.76%。其中，夏粮0.11万吨，比2012年增产22.22%。秋粮169.46万吨，比2012年增产3.75%。","future":"宁武县立足地方实际、科学分析县情，坚持完善了“4484”总体发展","plant":"img/fbt.png","agrometeorological":"img/qiht.png"}'));

var map;

$(function(){
	getMap();
	changeMap('保德县');
});
/**
 * 改变区县信息
 * @param name
 */
function cityChange(name){
	 for ( var index in listCity) {
		if(listCity[index].name==name){
			$("#feature").html(listCity[index].feature);
			$("#actuality").html(listCity[index].actuality);
			$("#future").html(listCity[index].future);
			$("#plant").attr("src",listCity[index].plant);
			$("#agrometeorological").attr("src",listCity[index].agrometeorological);
			changeMap(name);
		}
	 }
}
/**
 * 添加区县地图
 */
function getMap(){
     var zoom = 12;
     map = new T.Map('cityMap', {
         projection: 'EPSG:4326'
     });
     map.centerAndZoom(new T.LngLat(116.40769, 39.89945), zoom);
}

/**
 * 修改中心点,以及添加行政边界,添加中心点图标
 * @param name
 */
function changeMap(name){
	map.clearOverLays();
	var city=getCityLnglat(name);
	getArea(city.area.points);
	 var icon = new T.Icon({
         iconUrl: "img/location.png",
         iconSize: new T.Point(24, 24),
         iconAnchor: new T.Point(10, 25)
     });
    var marker = new T.Marker(new T.LngLat(city.area.lonlat.split(",")[0],city.area.lonlat.split(",")[1]), {icon: icon,title:name});
    map.addOverLay(marker);
 	map.panTo(new T.LngLat(city.area.lonlat.split(",")[0],city.area.lonlat.split(",")[1]));
}

/**
 * 添加行政边界
 */
function getArea(points){
	var pointsArr = [];
	for ( var i = 0; i < points.length; i++) {
		var regionArr = points[i].region.split(",");
		for ( var m = 0; m < regionArr.length; m++) {
			var lnglatArr = regionArr[m].split(" ");
			var lnglat = new T.LngLat(lnglatArr[0], lnglatArr[1]);
			pointsArr.push(lnglat);
		}
	}
	 var polygon = new T.Polygon(pointsArr, {
		 	color : "#242424",
			weight : 2,
			fillOpacity:0,
			opacity : 1,
			lineStyle : "dashed",
			name:name
	}); 
	map.addOverLay(polygon);
}

/**
 * 获取城市经信息
 */
function getCityLnglat(name){
	var data="";
	$.ajax({
		type : "get",
		async : false,
		url : 'http://www.tianditu.com/query.shtml?postStr={"keyWord":"'+name+'","level":"11","mapBound":"116.04577,39.70307,116.77361,40.09583","queryType":"1","count":"20","start":"0"}&type=query',
		success : function(result) {
			data=JSON.parse(result);
		}
	});
	return data;
}
/**
 * 图片展示
 */
$('.check-btn').on('click',function () {
	  $("#zhanshi").attr("src",$(this).attr("src"));
	  $('.zhezhao').fadeIn();
	  $('.tanchu').fadeIn();
});
/**
 * 取消展示
 */
$('.zhezhao').on('click',function () {
	  $('.zhezhao').fadeOut();
	  $('.tanchu').fadeOut();
});

